
## Plan Result




<pre><code>Plan: 3 to add, 4 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_application_insights.em_appinsights
  * azurerm_key_vault_secret.em_app_insights_connection_string
  * azurerm_key_vault_secret.em_app_insights_key
* Update
  * azurerm_resource_group.rg
  * module.key_vault.azurerm_key_vault.kv
  * module.key_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.key_vault.azurerm_user_assigned_identity.managed_identity[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.em_appinsights will be created
  + resource "azurerm_application_insights" "em_appinsights" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "em-aat"
      + resource_group_name                   = "rpa-aat"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "BuiltFrom"           = "https://github.com/HMCTS/em-shared-infrastructure.git"
          + "Destroy Me"          = "No"
          + "Team Contact"        = "#em-dev-chat"
          + "application"         = "evidence-management"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#em-dev-chat"
          + "environment"         = "staging"
          + "managedBy"           = "Evidence Management"
        }
    }

  # azurerm_key_vault_secret.em_app_insights_connection_string will be created
  + resource "azurerm_key_vault_secret" "em_app_insights_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpa-aat/providers/Microsoft.KeyVault/vaults/rpa-aat"
      + name                    = "em-app-insights-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.em_app_insights_key will be created
  + resource "azurerm_key_vault_secret" "em_app_insights_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpa-aat/providers/Microsoft.KeyVault/vaults/rpa-aat"
      + name                    = "EmAppInsightsInstrumentationKey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpa-aat"
        name     = "rpa-aat"
      ~ tags     = {
          + "Destroy Me"          = "No"
          + "Team Contact"        = "#em-dev-chat"
          ~ "application"         = "professional-applications" -> "evidence-management"
          ~ "contactSlackChannel" = "#rpa-pipeline" -> "#em-dev-chat"
          ~ "managedBy"           = "Professional Applications" -> "Evidence Management"
            # (4 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.key_vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpa-aat/providers/Microsoft.KeyVault/vaults/rpa-aat"
        name                            = "rpa-aat"
      ~ tags                            = {
          + "Destroy Me"          = "No"
          + "Team Contact"        = "#em-dev-chat"
          ~ "application"         = "professional-applications" -> "evidence-management"
          ~ "contactSlackChannel" = "#rpa-pipeline" -> "#em-dev-chat"
          ~ "managedBy"           = "Professional Applications" -> "Evidence Management"
            # (4 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpa-aat/providers/Microsoft.KeyVault/vaults/rpa-aat|rpa-aat"
        name                       = "rpa-aat"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # module.key_vault.azurerm_user_assigned_identity.managed_identity[0] will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "managed_identity" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/managed-identities-aat-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/rpa-aat-mi"
        name                = "rpa-aat-mi"
      ~ tags                = {
          + "Destroy Me"          = "No"
          + "Team Contact"        = "#em-dev-chat"
          ~ "application"         = "professional-applications" -> "evidence-management"
          ~ "contactSlackChannel" = "#rpa-pipeline" -> "#em-dev-chat"
          ~ "managedBy"           = "Professional Applications" -> "Evidence Management"
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

Plan: 3 to add, 4 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":111,"Program":"tfcmt","SHA1":"","Vars":{}} -->